# Terraform `environment` `test`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD1jMjE3YTNlYS00MDJmLTQ4ODYtYWNlNS00NzhkYjcyYWI0Yzk7b2JqZWN0SWQ9Y2M3NWExY2MtZDZhMS00NTMwLTgyOGYtODY4MzJjZTkxYjliO3N1YnNjcmlwdGlvbklkPTFjZThlOWFmLWMyZDYtNDRlNy05YzVlLTA5OWEzMDgwNTZmZTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_kubernetes_cluster.k6tests will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_kubernetes_cluster" "k6tests" {
      + aci_connector_linux                              = (known after apply)
      + agent_pool_profile                               = (known after apply)
      + api_server_authorized_ip_ranges                  = (known after apply)
      + azure_active_directory_role_based_access_control = (known after apply)
      + azure_policy_enabled                             = (known after apply)
      + current_kubernetes_version                       = (known after apply)
      + disk_encryption_set_id                           = (known after apply)
      + dns_prefix                                       = (known after apply)
      + fqdn                                             = (known after apply)
      + http_application_routing_enabled                 = (known after apply)
      + http_application_routing_zone_name               = (known after apply)
      + id                                               = (known after apply)
      + identity                                         = (known after apply)
      + ingress_application_gateway                      = (known after apply)
      + key_management_service                           = (known after apply)
      + key_vault_secrets_provider                       = (known after apply)
      + kube_admin_config                                = (sensitive value)
      + kube_admin_config_raw                            = (sensitive value)
      + kube_config                                      = (sensitive value)
      + kube_config_raw                                  = (sensitive value)
      + kubelet_identity                                 = (known after apply)
      + kubernetes_version                               = (known after apply)
      + linux_profile                                    = (known after apply)
      + location                                         = (known after apply)
      + microsoft_defender                               = (known after apply)
      + name                                             = "k6tests-cluster-F7sT"
      + network_profile                                  = (known after apply)
      + node_resource_group                              = (known after apply)
      + node_resource_group_id                           = (known after apply)
      + oidc_issuer_enabled                              = (known after apply)
      + oidc_issuer_url                                  = (known after apply)
      + oms_agent                                        = (known after apply)
      + open_service_mesh_enabled                        = (known after apply)
      + private_cluster_enabled                          = (known after apply)
      + private_fqdn                                     = (known after apply)
      + resource_group_name                              = "k6tests-rg-F7sT"
      + role_based_access_control_enabled                = (known after apply)
      + service_mesh_profile                             = (known after apply)
      + service_principal                                = (known after apply)
      + storage_profile                                  = (known after apply)
      + tags                                             = (known after apply)
      + windows_profile                                  = (known after apply)
    }

  # data.azurerm_monitor_data_collection_endpoint.k6tests will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_data_collection_endpoint" "k6tests" {
      + configuration_access_endpoint = (known after apply)
      + description                   = (known after apply)
      + id                            = (known after apply)
      + immutable_id                  = (known after apply)
      + kind                          = (known after apply)
      + location                      = (known after apply)
      + logs_ingestion_endpoint       = (known after apply)
      + metrics_ingestion_endpoint    = (known after apply)
      + name                          = "k6tests-amw-F7sT"
      + public_network_access_enabled = (known after apply)
      + resource_group_name           = "MA_k6tests-amw-F7sT_norwayeast_managed"
      + tags                          = (known after apply)
    }

  # data.azurerm_monitor_data_collection_rule.k6tests will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_monitor_data_collection_rule" "k6tests" {
      + data_collection_endpoint_id = (known after apply)
      + data_flow                   = (known after apply)
      + data_sources                = (known after apply)
      + description                 = (known after apply)
      + destinations                = (known after apply)
      + id                          = (known after apply)
      + identity                    = (known after apply)
      + immutable_id                = (known after apply)
      + kind                        = (known after apply)
      + location                    = (known after apply)
      + name                        = "k6tests-dcr-F7sT"
      + resource_group_name         = "k6tests-rg-F7sT"
      + stream_declaration          = (known after apply)
      + tags                        = (known after apply)
    }

  # module.foundational.azurerm_kubernetes_cluster_node_pool.prometheus will be updated in-place
  ~ resource "azurerm_kubernetes_cluster_node_pool" "prometheus" {
        id                            = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster-F7sT/agentPools/prometheus"
        name                          = "prometheus"
        tags                          = {}
      + temporary_name_for_rotation   = "tmpprom"
        # (31 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.foundational.azurerm_kubernetes_cluster_node_pool.spot will be updated in-place
  ~ resource "azurerm_kubernetes_cluster_node_pool" "spot" {
        id                            = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster-F7sT/agentPools/spot"
      ~ max_count                     = 10 -> 3
        name                          = "spot"
      ~ node_labels                   = {
          + "spot"                                  = "true"
            # (1 unchanged element hidden)
        }
        tags                          = {}
      + temporary_name_for_rotation   = "tmpspot"
      ~ vm_size                       = "Standard_DS2_v2" -> "Standard_D3_v2"
        # (28 unchanged attributes hidden)
    }

  # module.foundational.azurerm_kubernetes_cluster_node_pool.spot8c28g will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "spot8c28g" {
      + auto_scaling_enabled        = true
      + eviction_policy             = "Delete"
      + id                          = (known after apply)
      + kubelet_disk_type           = (known after apply)
      + kubernetes_cluster_id       = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/k6tests-rg-F7sT/providers/Microsoft.ContainerService/managedClusters/k6tests-cluster-F7sT"
      + max_count                   = 3
      + max_pods                    = (known after apply)
      + min_count                   = 0
      + mode                        = "User"
      + name                        = "spot8c28g"
      + node_count                  = 0
      + node_labels                 = {
          + "kubernetes.azure.com/scalesetpriority" = "spot"
          + "spot8cpu28gbmem"                       = "true"
        }
      + node_taints                 = [
          + "kubernetes.azure.com/scalesetpriority=spot:NoSchedule",
        ]
      + orchestrator_version        = (known after apply)
      + os_disk_size_gb             = (known after apply)
      + os_disk_type                = "Managed"
      + os_sku                      = (known after apply)
      + os_type                     = "Linux"
      + priority                    = "Spot"
      + scale_down_mode             = "Delete"
      + spot_max_price              = -1
      + temporary_name_for_rotation = "tmpd8c28g"
      + ultra_ssd_enabled           = false
      + vm_size                     = "Standard_D4_v2"
    }

  # module.services.azuread_application.prometheus will be destroyed
  # (because azuread_application.prometheus is not in configuration)
  - resource "azuread_application" "prometheus" {
      - app_role_ids                   = {} -> null
      - client_id                      = "0626b615-9933-46fc-84ec-b08ad8bb1b79" -> null
      - device_only_auth_enabled       = false -> null
      - display_name                   = "adminservicestest-k6tests-prometheus-F7sT" -> null
      - fallback_public_client_enabled = false -> null
      - group_membership_claims        = [] -> null
      - id                             = "/applications/14406d89-2c70-4bb9-96c4-252f667156ff" -> null
      - identifier_uris                = [] -> null
      - oauth2_permission_scope_ids    = {} -> null
      - oauth2_post_response_required  = false -> null
      - object_id                      = "14406d89-2c70-4bb9-96c4-252f667156ff" -> null
      - owners                         = [] -> null
      - prevent_duplicate_names        = false -> null
      - publisher_domain               = "ai-dev.no" -> null
      - sign_in_audience               = "AzureADMyOrg" -> null
      - tags                           = [] -> null
        # (11 unchanged attributes hidden)

      - api {
          - known_client_applications      = [] -> null
          - mapped_claims_enabled          = false -> null
          - requested_access_token_version = 1 -> null
        }

      - feature_tags {
          - custom_single_sign_on = false -> null
          - enterprise            = false -> null
          - gallery               = false -> null
          - hide                  = false -> null
        }

      - optional_claims {
        }

      - public_client {
          - redirect_uris = [] -> null
        }

      - single_page_application {
          - redirect_uris = [] -> null
        }

      - web {
          - redirect_uris = [] -> null
            # (2 unchanged attributes hidden)

          - implicit_grant {
              - access_token_issuance_enabled = false -> null
              - id_token_issuance_enabled     = false -> null
            }
        }
    }

  # module.services.azuread_application_federated_identity_credential.prometheus will be destroyed
  # (because azuread_application_federated_identity_credential.prometheus is not in configuration)
  - resource "azuread_application_federated_identity_credential" "prometheus" {
      - application_id = "/applications/14406d89-2c70-4bb9-96c4-252f667156ff" -> null
      - audiences      = [
          - "api://AzureADTokenExchange",
        ] -> null
      - credential_id  = "6a72038e-3832-451a-9b3c-e5121f92e1ae" -> null
      - display_name   = "adminservicestest-k6tests-prometheus-F7sT" -> null
      - id             = "14406d89-2c70-4bb9-96c4-252f667156ff/federatedIdentityCredential/6a72038e-3832-451a-9b3c-e5121f92e1ae" -> null
      - issuer         = "https://norwayeast.oic.prod-aks.azure.com/cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c/ad6108ad-c807-45af-9f6e-7807f38ff4ea/" -> null
      - subject        = "system:serviceaccount:monitoring:kube-prometheus-stack-prometheus" -> null
        # (1 unchanged attribute hidden)
    }

  # module.services.azuread_service_principal.prometheus will be destroyed
  # (because azuread_service_principal.prometheus is not in configuration)
  - resource "azuread_service_principal" "prometheus" {
      - account_enabled               = true -> null
      - alternative_names             = [] -> null
      - app_role_assignment_required  = false -> null
      - app_role_ids                  = {} -> null
      - app_roles                     = [] -> null
      - application_tenant_id         = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c" -> null
      - client_id                     = "0626b615-9933-46fc-84ec-b08ad8bb1b79" -> null
      - display_name                  = "adminservicestest-k6tests-prometheus-F7sT" -> null
      - id                            = "/servicePrincipals/7d3984d6-d70b-462f-aa39-ddc10c96de21" -> null
      - notification_email_addresses  = [] -> null
      - oauth2_permission_scope_ids   = {} -> null
      - oauth2_permission_scopes      = [] -> null
      - object_id                     = "7d3984d6-d70b-462f-aa39-ddc10c96de21" -> null
      - owners                        = [] -> null
      - redirect_uris                 = [] -> null
      - service_principal_names       = [] -> null
      - sign_in_audience              = "AzureADMyOrg" -> null
      - tags                          = [] -> null
      - type                          = "Application" -> null
        # (7 unchanged attributes hidden)

      - feature_tags {
          - custom_single_sign_on = false -> null
          - enterprise            = false -> null
          - gallery               = false -> null
          - hide                  = false -> null
        }

      - features {
          - custom_single_sign_on_app = false -> null
          - enterprise_application    = false -> null
          - gallery_application       = false -> null
          - visible_to_users          = true -> null
        }

      - saml_single_sign_on {
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.azurerm_role_assignment.monitoring_metrics_publisher will be destroyed
  # (because azurerm_role_assignment.monitoring_metrics_publisher is not in configuration)
  - resource "azurerm_role_assignment" "monitoring_metrics_publisher" {
      - id                                     = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_k6tests-amw-F7sT_norwayeast_managed/providers/Microsoft.Insights/dataCollectionEndpoints/k6tests-amw-F7sT/providers/Microsoft.Authorization/roleAssignments/11d25824-476b-dbae-3c85-5c9acb54aa7f" -> null
      - name                                   = "11d25824-476b-dbae-3c85-5c9acb54aa7f" -> null
      - principal_id                           = "7d3984d6-d70b-462f-aa39-ddc10c96de21" -> null
      - principal_type                         = "ServicePrincipal" -> null
      - role_definition_id                     = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/providers/Microsoft.Authorization/roleDefinitions/3913510d-42f4-4e42-8a64-420c390055eb" -> null
      - role_definition_name                   = "Monitoring Metrics Publisher" -> null
      - scope                                  = "/subscriptions/1ce8e9af-c2d6-44e7-9c5e-099a308056fe/resourceGroups/MA_k6tests-amw-F7sT_norwayeast_managed/providers/Microsoft.Insights/dataCollectionEndpoints/k6tests-amw-F7sT" -> null
        # (4 unchanged attributes hidden)
    }

  # module.services.helm_release.k6_operator will be destroyed
  # (because helm_release.k6_operator is not in configuration)
  - resource "helm_release" "k6_operator" {
      - atomic                     = false -> null
      - chart                      = "k6-operator" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = true -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "k6-operator" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = {
          - app_version    = "0.0.22" -> null
          - chart          = "k6-operator" -> null
          - first_deployed = 1744372041 -> null
          - last_deployed  = 1753259966 -> null
          - name           = "k6-operator" -> null
          - namespace      = "k6-operator-system" -> null
          - notes          = <<-EOT
                Thank you for installing k6-operator.
                
                Your release is named k6-operator.
                
                To learn more about the release, try:
                
                  $ helm status k6-operator
                  $ helm get all k6-operator
            EOT -> null
          - revision       = 4 -> null
          - values         = jsonencode(
                {
                  - installCRDs = true
                  - namespace   = {
                      - create = false
                    }
                }
            ) -> null
          - version        = "3.14.2" -> null
        } -> null
      - name                       = "k6-operator" -> null
      - namespace                  = "k6-operator-system" -> null
      - pass_credentials           = false -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://grafana.github.io/helm-charts" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - set_wo                     = (write-only attribute) -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 300 -> null
      - values                     = [
          - <<-EOT
                installCRDs: true
                
                namespace:
                  create: false
            EOT,
        ] -> null
      - verify                     = false -> null
      - version                    = "3.14.2" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null
    }

  # module.services.helm_release.kube_prometheus_stack will be destroyed
  # (because helm_release.kube_prometheus_stack is not in configuration)
  - resource "helm_release" "kube_prometheus_stack" {
      - atomic                     = false -> null
      - chart                      = "kube-prometheus-stack" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = true -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "kube-prometheus-stack" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = {
          - app_version    = "v0.83.0" -> null
          - chart          = "kube-prometheus-stack" -> null
          - first_deployed = 1744372042 -> null
          - last_deployed  = 1753259966 -> null
          - name           = "kube-prometheus-stack" -> null
          - namespace      = "monitoring" -> null
          - notes          = <<-EOT
                kube-state-metrics is a simple service that listens to the Kubernetes API server and generates metrics about the state of the objects.
                The exposed metrics can be found here:
                https://github.com/kubernetes/kube-state-metrics/blob/master/docs/README.md#exposed-metrics
                
                The metrics are exported on the HTTP endpoint /metrics on the listening port.
                In your case, kube-prometheus-stack-kube-state-metrics.monitoring.svc.cluster.local:8080/metrics
                
                They are served either as plaintext or protobuf depending on the Accept header.
                They are designed to be consumed either by Prometheus itself or by a scraper that is compatible with scraping a Prometheus client endpoint.
                
                1. Get the application URL by running these commands:
                  export POD_NAME=$(kubectl get pods --namespace monitoring -l "app.kubernetes.io/name=prometheus-node-exporter,app.kubernetes.io/instance=kube-prometheus-stack" -o jsonpath="{.items[0].metadata.name}")
                  echo "Visit http://127.0.0.1:9100 to use your application"
                  kubectl port-forward --namespace monitoring $POD_NAME 9100
                kube-prometheus-stack has been installed. Check its status by running:
                  kubectl --namespace monitoring get pods -l "release=kube-prometheus-stack"
                
                Get Grafana 'admin' user password by running:
                
                  kubectl --namespace monitoring get secrets kube-prometheus-stack-grafana -o jsonpath="{.data.admin-password}" | base64 -d ; echo
                
                Access Grafana local instance:
                
                  export POD_NAME=$(kubectl --namespace monitoring get pod -l "app.kubernetes.io/name=grafana,app.kubernetes.io/instance=kube-prometheus-stack" -oname)
                  kubectl --namespace monitoring port-forward $POD_NAME 3000
                
                Visit https://github.com/prometheus-operator/kube-prometheus for instructions on how to create & configure Alertmanager and Prometheus instances using the Operator.
            EOT -> null
          - revision       = 4 -> null
          - values         = jsonencode(
                {
                  - alertmanager = {
                      - enabled = true
                    }
                  - crds         = {
                      - enabled = false
                    }
                  - grafana      = {
                      - enabled = false
                    }
                  - prometheus   = {
                      - enabled        = true
                      - prometheusSpec = {
                          - enableRemoteWriteReceiver = true
                          - externalLabels            = {
                              - cluster = "k6tests-cluster-F7sT"
                            }
                          - nodeSelector              = {
                              - workload = "prometheus"
                            }
                          - podMetadata               = {
                              - labels = {
                                  - "azure.workload.identity/use" = "true"
                                }
                            }
                          - priorityClassName         = "system-cluster-critical"
                          - remoteWrite               = [
                              - {
                                  - azureAd = {
                                      - cloud = "AzurePublic"
                                      - sdk   = {
                                          - tenantId = "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
                                        }
                                    }
                                  - url     = "https://k6tests-amw-f7st-jewy.norwayeast-1.metrics.ingest.monitor.azure.com/dataCollectionRules/dcr-e1d754e0800647b6930fc57a08aa3c7c/streams/Microsoft-PrometheusMetrics/api/v1/write?api-version=2023-04-24"
                                },
                            ]
                          - resources                 = {
                              - requests = {
                                  - memory = "8Gi"
                                }
                            }
                          - retention                 = "8d"
                          - storageSpec               = {
                              - volumeClaimTemplate = {
                                  - spec = {
                                      - resources = {
                                          - requests = {
                                              - storage = "64Gi"
                                            }
                                        }
                                    }
                                }
                            }
                          - tolerations               = [
                              - {
                                  - effect   = "NoSchedule"
                                  - key      = "workload"
                                  - operator = "Equal"
                                  - value    = "prometheus"
                                },
                            ]
                        }
                      - serviceAccount = {
                          - annotations = {
                              - "azure.workload.identity/client-id" = "0626b615-9933-46fc-84ec-b08ad8bb1b79"
                            }
                        }
                    }
                }
            ) -> null
          - version        = "75.12.0" -> null
        } -> null
      - name                       = "kube-prometheus-stack" -> null
      - namespace                  = "monitoring" -> null
      - pass_credentials           = false -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://prometheus-community.github.io/helm-charts" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - set_wo                     = (write-only attribute) -> null
      - skip_crds                  = true -> null
      - status                     = "deployed" -> null
      - timeout                    = 300 -> null
      - values                     = [
          - <<-EOT
                crds:
                  enabled: false
                alertmanager:
                  enabled: true
                grafana:
                  enabled: false
                prometheus:
                  enabled: true
                  serviceAccount:
                    annotations:
                      azure.workload.identity/client-id: "0626b615-9933-46fc-84ec-b08ad8bb1b79"
                  prometheusSpec:
                    podMetadata:
                      labels:
                        azure.workload.identity/use: "true"
                    externalLabels:
                      cluster: "k6tests-cluster-F7sT"
                    enableRemoteWriteReceiver: true
                    remoteWrite:
                      - url: "https://k6tests-amw-f7st-jewy.norwayeast-1.metrics.ingest.monitor.azure.com/dataCollectionRules/dcr-e1d754e0800647b6930fc57a08aa3c7c/streams/Microsoft-PrometheusMetrics/api/v1/write?api-version=2023-04-24"
                        azureAd:
                          cloud: "AzurePublic"
                          sdk:
                            tenantId: "cd0026d8-283b-4a55-9bfa-d0ef4a8ba21c"
                    tolerations:
                      - key: "workload"
                        operator: "Equal"
                        value: "prometheus"
                        effect: "NoSchedule"
                    resources:
                      requests:
                        memory: 8Gi
                    nodeSelector:
                      workload: "prometheus"
                    priorityClassName: "system-cluster-critical"
                    retention: 8d
                    storageSpec:
                      volumeClaimTemplate:
                        spec:
                          resources:
                            requests:
                              storage: 64Gi
            EOT,
        ] -> null
      - verify                     = false -> null
      - version                    = "75.12.0" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null
    }

  # module.services.helm_release.prometheus_operator_crds will be destroyed
  # (because helm_release.prometheus_operator_crds is not in configuration)
  - resource "helm_release" "prometheus_operator_crds" {
      - atomic                     = false -> null
      - chart                      = "prometheus-operator-crds" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = false -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "prometheus-operator-crds" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = {
          - app_version    = "v0.84.0" -> null
          - chart          = "prometheus-operator-crds" -> null
          - first_deployed = 1744372023 -> null
          - last_deployed  = 1753259937 -> null
          - name           = "prometheus-operator-crds" -> null
          - namespace      = "default" -> null
          - notes          = "" -> null
          - revision       = 5 -> null
          - values         = jsonencode({})
          - version        = "22.0.1" -> null
        } -> null
      - name                       = "prometheus-operator-crds" -> null
      - namespace                  = "default" -> null
      - pass_credentials           = false -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://prometheus-community.github.io/helm-charts" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - set_wo                     = (write-only attribute) -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 300 -> null
      - verify                     = false -> null
      - version                    = "22.0.1" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null
    }

  # module.services.helm_release.pyrra will be destroyed
  # (because helm_release.pyrra is not in configuration)
  - resource "helm_release" "pyrra" {
      - atomic                     = false -> null
      - chart                      = "pyrra" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = true -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "pyrra" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = {
          - app_version    = "v0.8.1" -> null
          - chart          = "pyrra" -> null
          - first_deployed = 1744372022 -> null
          - last_deployed  = 1750860345 -> null
          - name           = "pyrra" -> null
          - namespace      = "pyrra-system" -> null
          - notes          = <<-EOT
                1. Get the application URL by running these commands:
                  export POD_NAME=$(kubectl get pods --namespace pyrra-system -l "app.kubernetes.io/name=pyrra,app.kubernetes.io/instance=pyrra" -o jsonpath="{.items[0].metadata.name}")
                  export CONTAINER_PORT=$(kubectl get pod --namespace pyrra-system $POD_NAME -o jsonpath="{.spec.containers[0].ports[0].containerPort}")
                  echo "Visit http://127.0.0.1:8080 to use your application"
                  kubectl --namespace pyrra-system port-forward $POD_NAME 8080:$CONTAINER_PORT
            EOT -> null
          - revision       = 3 -> null
          - values         = jsonencode(
                {
                  - genericRules = {
                      - enabled = true
                    }
                }
            ) -> null
          - version        = "0.14.3" -> null
        } -> null
      - name                       = "pyrra" -> null
      - namespace                  = "pyrra-system" -> null
      - pass_credentials           = false -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://rlex.github.io/helm-charts" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - set                        = [
          - {
              - name  = "genericRules.enabled" -> null
              - value = "true" -> null
                # (1 unchanged attribute hidden)
            },
        ] -> null
      - set_wo                     = (write-only attribute) -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 300 -> null
      - verify                     = false -> null
      - version                    = "0.14.3" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null
    }

  # module.services.helm_release.sealed_secrets will be destroyed
  # (because helm_release.sealed_secrets is not in configuration)
  - resource "helm_release" "sealed_secrets" {
      - atomic                     = false -> null
      - chart                      = "sealed-secrets" -> null
      - cleanup_on_fail            = false -> null
      - create_namespace           = true -> null
      - dependency_update          = false -> null
      - disable_crd_hooks          = false -> null
      - disable_openapi_validation = false -> null
      - disable_webhooks           = false -> null
      - force_update               = false -> null
      - id                         = "sealedsecrets" -> null
      - lint                       = false -> null
      - max_history                = 0 -> null
      - metadata                   = {
          - app_version    = "0.30.0" -> null
          - chart          = "sealed-secrets" -> null
          - first_deployed = 1744372022 -> null
          - last_deployed  = 1750860345 -> null
          - name           = "sealedsecrets" -> null
          - namespace      = "sealedsecrets-system" -> null
          - notes          = <<-EOT
                ** Please be patient while the chart is being deployed **
                
                You should now be able to create sealed secrets.
                
                1. Install the client-side tool (kubeseal) as explained in the docs below:
                
                    https://github.com/bitnami-labs/sealed-secrets#installation-from-source
                
                2. Create a sealed secret file running the command below:
                
                    kubectl create secret generic secret-name --dry-run=client --from-literal=foo=bar -o [json|yaml] | \
                    kubeseal \
                      --controller-name=sealedsecrets-sealed-secrets \
                      --controller-namespace=sealedsecrets-system \
                      --format yaml > mysealedsecret.[json|yaml]
                
                The file mysealedsecret.[json|yaml] is a commitable file.
                
                If you would rather not need access to the cluster to generate the sealed secret you can run:
                
                    kubeseal \
                      --controller-name=sealedsecrets-sealed-secrets \
                      --controller-namespace=sealedsecrets-system \
                      --fetch-cert > mycert.pem
                
                to retrieve the public cert used for encryption and store it locally. You can then run 'kubeseal --cert mycert.pem' instead to use the local cert e.g.
                
                    kubectl create secret generic secret-name --dry-run=client --from-literal=foo=bar -o [json|yaml] | \
                    kubeseal \
                      --controller-name=sealedsecrets-sealed-secrets \
                      --controller-namespace=sealedsecrets-system \
                      --format [json|yaml] --cert mycert.pem > mysealedsecret.[json|yaml]
                
                3. Apply the sealed secret
                
                    kubectl create -f mysealedsecret.[json|yaml]
                
                Running 'kubectl get secret secret-name -o [json|yaml]' will show the decrypted secret that was generated from the sealed secret.
                
                Both the SealedSecret and generated Secret must have the same name and namespace.
            EOT -> null
          - revision       = 3 -> null
          - values         = jsonencode({})
          - version        = "2.17.3" -> null
        } -> null
      - name                       = "sealedsecrets" -> null
      - namespace                  = "sealedsecrets-system" -> null
      - pass_credentials           = false -> null
      - recreate_pods              = false -> null
      - render_subchart_notes      = true -> null
      - replace                    = false -> null
      - repository                 = "https://bitnami-labs.github.io/sealed-secrets" -> null
      - reset_values               = false -> null
      - reuse_values               = false -> null
      - set_wo                     = (write-only attribute) -> null
      - skip_crds                  = false -> null
      - status                     = "deployed" -> null
      - timeout                    = 300 -> null
      - verify                     = false -> null
      - version                    = "2.17.3" -> null
      - wait                       = true -> null
      - wait_for_jobs              = false -> null
    }

  # module.services.kubernetes_cluster_role_v1.dev_access will be destroyed
  # (because kubernetes_cluster_role_v1.dev_access is not in configuration)
  - resource "kubernetes_cluster_role_v1" "dev_access" {
      - id = "dev-access" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "dev-access" -> null
          - resource_version = "29410580" -> null
          - uid              = "311fd160-796c-4b56-8934-d39e45e674d9" -> null
            # (1 unchanged attribute hidden)
        }

      - rule {
          - api_groups        = [
              - null,
            ] -> null
          - non_resource_urls = [] -> null
          - resource_names    = [] -> null
          - resources         = [
              - "configmaps",
            ] -> null
          - verbs             = [
              - "get",
              - "list",
              - "watch",
              - "delete",
              - "patch",
            ] -> null
        }
      - rule {
          - api_groups        = [
              - null,
            ] -> null
          - non_resource_urls = [] -> null
          - resource_names    = [] -> null
          - resources         = [
              - "pods",
            ] -> null
          - verbs             = [
              - "get",
              - "list",
              - "watch",
            ] -> null
        }
      - rule {
          - api_groups        = [
              - "k6.io",
            ] -> null
          - non_resource_urls = [] -> null
          - resource_names    = [] -> null
          - resources         = [
              - "testruns",
            ] -> null
          - verbs             = [
              - "get",
              - "list",
              - "watch",
              - "create",
              - "update",
              - "patch",
              - "delete",
            ] -> null
        }
      - rule {
          - api_groups        = [
              - "bitnami.com",
            ] -> null
          - non_resource_urls = [] -> null
          - resource_names    = [] -> null
          - resources         = [
              - "sealedsecrets",
            ] -> null
          - verbs             = [
              - "list",
              - "watch",
              - "delete",
            ] -> null
        }
    }

  # module.services.kubernetes_cluster_role_v1.sp_access will be destroyed
  # (because kubernetes_cluster_role_v1.sp_access is not in configuration)
  - resource "kubernetes_cluster_role_v1" "sp_access" {
      - id = "github-sp-access" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "github-sp-access" -> null
          - resource_version = "29410581" -> null
          - uid              = "72147a20-0fa3-4a96-85f7-628edebf4a74" -> null
            # (1 unchanged attribute hidden)
        }

      - rule {
          - api_groups        = [
              - null,
            ] -> null
          - non_resource_urls = [] -> null
          - resource_names    = [] -> null
          - resources         = [
              - "configmaps",
            ] -> null
          - verbs             = [
              - "create",
              - "update",
              - "delete",
              - "get",
              - "patch",
            ] -> null
        }
      - rule {
          - api_groups        = [
              - "bitnami.com",
            ] -> null
          - non_resource_urls = [] -> null
          - resource_names    = [] -> null
          - resources         = [
              - "sealedsecrets",
            ] -> null
          - verbs             = [
              - "create",
              - "update",
            ] -> null
        }
      - rule {
          - api_groups        = [
              - "k6.io",
            ] -> null
          - non_resource_urls = [] -> null
          - resource_names    = [] -> null
          - resources         = [
              - "testruns",
            ] -> null
          - verbs             = [
              - "create",
              - "update",
              - "get",
              - "list",
              - "watch",
              - "delete",
              - "patch",
            ] -> null
        }
      - rule {
          - api_groups        = [
              - null,
            ] -> null
          - non_resource_urls = [] -> null
          - resource_names    = [] -> null
          - resources         = [
              - "pods",
            ] -> null
          - verbs             = [
              - "get",
              - "list",
            ] -> null
        }
      - rule {
          - api_groups        = [
              - null,
            ] -> null
          - non_resource_urls = [] -> null
          - resource_names    = [] -> null
          - resources         = [
              - "pods/log",
            ] -> null
          - verbs             = [
              - "get",
              - "list",
            ] -> null
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["authentication.at22"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at22.altinn.cloud"
        } -> null
      - id          = "authentication/deploy-environments-at22" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at22" -> null
          - namespace        = "authentication" -> null
          - resource_version = "690774" -> null
          - uid              = "baedd4ec-c5dc-4fbc-a9cd-be46fa764021" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["authentication.at23"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at23.altinn.cloud"
        } -> null
      - id          = "authentication/deploy-environments-at23" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at23" -> null
          - namespace        = "authentication" -> null
          - resource_version = "690797" -> null
          - uid              = "fe77742c-8ae1-420c-bff2-b8a3548f7e28" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["authentication.at24"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at24.altinn.cloud"
        } -> null
      - id          = "authentication/deploy-environments-at24" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at24" -> null
          - namespace        = "authentication" -> null
          - resource_version = "690759" -> null
          - uid              = "8fc5013d-a470-456c-822f-0d862d17be48" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["authentication.prod"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.altinn.no"
        } -> null
      - id          = "authentication/deploy-environments-prod" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-prod" -> null
          - namespace        = "authentication" -> null
          - resource_version = "690799" -> null
          - uid              = "f068b013-b2db-49b1-af85-ffd7777db25b" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["authentication.tt02"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.tt02.altinn.no"
        } -> null
      - id          = "authentication/deploy-environments-tt02" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-tt02" -> null
          - namespace        = "authentication" -> null
          - resource_version = "690771" -> null
          - uid              = "431ee52b-f07d-463a-9e5f-2cacbc9a0263" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["authentication.yt01"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.yt01.altinn.cloud"
        } -> null
      - id          = "authentication/deploy-environments-yt01" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-yt01" -> null
          - namespace        = "authentication" -> null
          - resource_version = "690801" -> null
          - uid              = "d363fe9e-ff9c-4ebc-8c06-d63465299e8d" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["core.at22"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at22.altinn.cloud"
        } -> null
      - id          = "core/deploy-environments-at22" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at22" -> null
          - namespace        = "core" -> null
          - resource_version = "690796" -> null
          - uid              = "53799edf-92e8-45f7-a4da-0370c634fcda" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["core.at23"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at23.altinn.cloud"
        } -> null
      - id          = "core/deploy-environments-at23" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at23" -> null
          - namespace        = "core" -> null
          - resource_version = "690775" -> null
          - uid              = "9ed3216b-4dac-427a-9b3c-b6d07115c64c" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["core.at24"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at24.altinn.cloud"
        } -> null
      - id          = "core/deploy-environments-at24" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at24" -> null
          - namespace        = "core" -> null
          - resource_version = "690802" -> null
          - uid              = "a39f1c59-cd21-40a4-b5af-43dfd96c824e" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["core.prod"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.altinn.no"
        } -> null
      - id          = "core/deploy-environments-prod" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-prod" -> null
          - namespace        = "core" -> null
          - resource_version = "690785" -> null
          - uid              = "e5b3569c-c28a-47e4-a2df-2367f278ff47" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["core.tt02"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.tt02.altinn.no"
        } -> null
      - id          = "core/deploy-environments-tt02" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-tt02" -> null
          - namespace        = "core" -> null
          - resource_version = "690798" -> null
          - uid              = "461dde92-cd9c-4ff1-b97c-dc785f5957e1" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["core.yt01"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.yt01.altinn.cloud"
        } -> null
      - id          = "core/deploy-environments-yt01" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-yt01" -> null
          - namespace        = "core" -> null
          - resource_version = "690769" -> null
          - uid              = "dce48c86-b542-41a7-ac22-087bf9a35bd7" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["correspondence.at22"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at22.altinn.cloud"
        } -> null
      - id          = "correspondence/deploy-environments-at22" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at22" -> null
          - namespace        = "correspondence" -> null
          - resource_version = "690772" -> null
          - uid              = "13cac433-1bae-4e46-a715-29432648cba6" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["correspondence.at23"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at23.altinn.cloud"
        } -> null
      - id          = "correspondence/deploy-environments-at23" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at23" -> null
          - namespace        = "correspondence" -> null
          - resource_version = "690783" -> null
          - uid              = "583e4894-43d6-4435-95fa-4c061e1d77d8" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["correspondence.at24"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at24.altinn.cloud"
        } -> null
      - id          = "correspondence/deploy-environments-at24" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at24" -> null
          - namespace        = "correspondence" -> null
          - resource_version = "690766" -> null
          - uid              = "119ba000-ef58-4c90-95b8-adb350de0aef" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["correspondence.prod"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.altinn.no"
        } -> null
      - id          = "correspondence/deploy-environments-prod" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-prod" -> null
          - namespace        = "correspondence" -> null
          - resource_version = "690768" -> null
          - uid              = "8334a6cc-0d79-45c1-b377-db9ac08c2c1b" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["correspondence.tt02"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.tt02.altinn.no"
        } -> null
      - id          = "correspondence/deploy-environments-tt02" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-tt02" -> null
          - namespace        = "correspondence" -> null
          - resource_version = "690776" -> null
          - uid              = "a287a4b9-23f4-474a-b7d7-a7303293f315" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["correspondence.yt01"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.yt01.altinn.cloud"
        } -> null
      - id          = "correspondence/deploy-environments-yt01" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-yt01" -> null
          - namespace        = "correspondence" -> null
          - resource_version = "690773" -> null
          - uid              = "f79eef3c-4064-4c50-8f2d-80c91a41a8a7" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["dialogporten.at22"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at22.altinn.cloud"
        } -> null
      - id          = "dialogporten/deploy-environments-at22" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at22" -> null
          - namespace        = "dialogporten" -> null
          - resource_version = "690749" -> null
          - uid              = "3b0448dd-3303-4664-a9cd-e0bc11f0555f" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["dialogporten.at23"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at23.altinn.cloud"
        } -> null
      - id          = "dialogporten/deploy-environments-at23" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at23" -> null
          - namespace        = "dialogporten" -> null
          - resource_version = "690780" -> null
          - uid              = "e8610d17-a94c-48d4-8f6b-168494789931" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["dialogporten.at24"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at24.altinn.cloud"
        } -> null
      - id          = "dialogporten/deploy-environments-at24" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at24" -> null
          - namespace        = "dialogporten" -> null
          - resource_version = "690757" -> null
          - uid              = "afbf595b-9f91-4b12-9a16-b661c97cc310" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["dialogporten.prod"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.altinn.no"
        } -> null
      - id          = "dialogporten/deploy-environments-prod" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-prod" -> null
          - namespace        = "dialogporten" -> null
          - resource_version = "690764" -> null
          - uid              = "662f3352-8927-454e-ae4b-f0bd7eee03bf" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["dialogporten.tt02"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.tt02.altinn.no"
        } -> null
      - id          = "dialogporten/deploy-environments-tt02" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-tt02" -> null
          - namespace        = "dialogporten" -> null
          - resource_version = "690784" -> null
          - uid              = "5dfce83e-717d-4fec-aeda-c592ec69ae75" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["dialogporten.yt01"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.yt01.altinn.cloud"
        } -> null
      - id          = "dialogporten/deploy-environments-yt01" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-yt01" -> null
          - namespace        = "dialogporten" -> null
          - resource_version = "690800" -> null
          - uid              = "f295e114-c2fc-4d91-b8fe-7047d3a011f0" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["platform.at22"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at22.altinn.cloud"
        } -> null
      - id          = "platform/deploy-environments-at22" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at22" -> null
          - namespace        = "platform" -> null
          - resource_version = "690767" -> null
          - uid              = "9a03e567-f908-427d-8b03-f398e5f7afdb" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["platform.at23"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at23.altinn.cloud"
        } -> null
      - id          = "platform/deploy-environments-at23" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at23" -> null
          - namespace        = "platform" -> null
          - resource_version = "690756" -> null
          - uid              = "00ccf7ed-f2eb-4a9c-9505-968a26865017" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["platform.at24"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.at24.altinn.cloud"
        } -> null
      - id          = "platform/deploy-environments-at24" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-at24" -> null
          - namespace        = "platform" -> null
          - resource_version = "690782" -> null
          - uid              = "d6d535a5-d3d0-4a1c-9ab6-7d9b78e5655b" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["platform.prod"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.altinn.no"
        } -> null
      - id          = "platform/deploy-environments-prod" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-prod" -> null
          - namespace        = "platform" -> null
          - resource_version = "690779" -> null
          - uid              = "8fea22fa-1690-4530-85a3-4c71859f48ef" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["platform.tt02"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.tt02.altinn.no"
        } -> null
      - id          = "platform/deploy-environments-tt02" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-tt02" -> null
          - namespace        = "platform" -> null
          - resource_version = "690781" -> null
          - uid              = "157cd40a-e947-4ad7-959c-e51f0f4b120e" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_config_map_v1.deploy_environments_manifests["platform.yt01"] will be destroyed
  # (because kubernetes_config_map_v1.deploy_environments_manifests is not in configuration)
  - resource "kubernetes_config_map_v1" "deploy_environments_manifests" {
      - binary_data = {} -> null
      - data        = {
          - "BASE_URL" = "https://platform.yt01.altinn.cloud"
        } -> null
      - id          = "platform/deploy-environments-yt01" -> null
      - immutable   = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "deploy-environments-yt01" -> null
          - namespace        = "platform" -> null
          - resource_version = "690765" -> null
          - uid              = "5078b994-d21e-47b6-960d-ad689767e8aa" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_namespace.namespace["authentication"] will be destroyed
  # (because kubernetes_namespace.namespace is not in configuration)
  - resource "kubernetes_namespace" "namespace" {
      - id                               = "authentication" -> null
      - wait_for_default_service_account = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "authentication" -> null
          - resource_version = "690730" -> null
          - uid              = "8983af88-a20d-436b-b26a-94f15869ec2e" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_namespace.namespace["core"] will be destroyed
  # (because kubernetes_namespace.namespace is not in configuration)
  - resource "kubernetes_namespace" "namespace" {
      - id                               = "core" -> null
      - wait_for_default_service_account = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "core" -> null
          - resource_version = "690729" -> null
          - uid              = "53bba671-61e2-449a-b32e-5af9948ba014" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_namespace.namespace["correspondence"] will be destroyed
  # (because kubernetes_namespace.namespace is not in configuration)
  - resource "kubernetes_namespace" "namespace" {
      - id                               = "correspondence" -> null
      - wait_for_default_service_account = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "correspondence" -> null
          - resource_version = "690741" -> null
          - uid              = "1620ba58-1084-4f1d-becb-e1595ded0062" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_namespace.namespace["dialogporten"] will be destroyed
  # (because kubernetes_namespace.namespace is not in configuration)
  - resource "kubernetes_namespace" "namespace" {
      - id                               = "dialogporten" -> null
      - wait_for_default_service_account = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "dialogporten" -> null
          - resource_version = "690727" -> null
          - uid              = "27f80db3-1a10-4e1f-9a17-fdafb6796fec" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_namespace.namespace["platform"] will be destroyed
  # (because kubernetes_namespace.namespace is not in configuration)
  - resource "kubernetes_namespace" "namespace" {
      - id                               = "platform" -> null
      - wait_for_default_service_account = false -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "platform" -> null
          - resource_version = "690728" -> null
          - uid              = "48f4c138-f3b5-4452-b4cb-f948ca2f65e1" -> null
            # (1 unchanged attribute hidden)
        }
    }

  # module.services.kubernetes_role_binding_v1.dev_access["authentication"] will be destroyed
  # (because kubernetes_role_binding_v1.dev_access is not in configuration)
  - resource "kubernetes_role_binding_v1" "dev_access" {
      - id = "authentication/dev-access" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "dev-access" -> null
          - namespace        = "authentication" -> null
          - resource_version = "690746" -> null
          - uid              = "81e9ecc2-bc7a-4cbf-9501-6f18b2e0939b" -> null
            # (1 unchanged attribute hidden)
        }

      - role_ref {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "ClusterRole" -> null
          - name      = "dev-access" -> null
        }

      - subject {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "Group" -> null
          - name      = "5c42ac79-86e2-46d0-85d3-ae751dd5f057" -> null
          - namespace = "authentication" -> null
        }
    }

  # module.services.kubernetes_role_binding_v1.dev_access["core"] will be destroyed
  # (because kubernetes_role_binding_v1.dev_access is not in configuration)
  - resource "kubernetes_role_binding_v1" "dev_access" {
      - id = "core/dev-access" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "dev-access" -> null
          - namespace        = "core" -> null
          - resource_version = "690748" -> null
          - uid              = "e6df9d43-b70e-4c36-a799-e028406cdf8c" -> null
            # (1 unchanged attribute hidden)
        }

      - role_ref {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "ClusterRole" -> null
          - name      = "dev-access" -> null
        }

      - subject {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "Group" -> null
          - name      = "4dde4651-a9ca-4df1-9e05-216272284c7d" -> null
          - namespace = "core" -> null
        }
    }

  # module.services.kubernetes_role_binding_v1.dev_access["correspondence"] will be destroyed
  # (because kubernetes_role_binding_v1.dev_access is not in configuration)
  - resource "kubernetes_role_binding_v1" "dev_access" {
      - id = "correspondence/dev-access" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "dev-access" -> null
          - namespace        = "correspondence" -> null
          - resource_version = "690747" -> null
          - uid              = "13149be8-0d22-4306-accb-ce5385ce78d6" -> null
            # (1 unchanged attribute hidden)
        }

      - role_ref {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "ClusterRole" -> null
          - name      = "dev-access" -> null
        }

      - subject {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "Group" -> null
          - name      = "954a4d24-8c7e-4382-9861-2b5d1a515253" -> null
          - namespace = "correspondence" -> null
        }
    }

  # module.services.kubernetes_role_binding_v1.dev_access["dialogporten"] will be destroyed
  # (because kubernetes_role_binding_v1.dev_access is not in configuration)
  - resource "kubernetes_role_binding_v1" "dev_access" {
      - id = "dialogporten/dev-access" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "dev-access" -> null
          - namespace        = "dialogporten" -> null
          - resource_version = "690751" -> null
          - uid              = "121e240b-3c47-4318-a802-fecb27030ca2" -> null
            # (1 unchanged attribute hidden)
        }

      - role_ref {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "ClusterRole" -> null
          - name      = "dev-access" -> null
        }

      - subject {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "Group" -> null
          - name      = "c403060d-5c8a-41b0-8c19-84fa60d0ce18" -> null
          - namespace = "dialogporten" -> null
        }
    }

  # module.services.kubernetes_role_binding_v1.sp_access["authentication"] will be destroyed
  # (because kubernetes_role_binding_v1.sp_access is not in configuration)
  - resource "kubernetes_role_binding_v1" "sp_access" {
      - id = "authentication/github-sp-access" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "github-sp-access" -> null
          - namespace        = "authentication" -> null
          - resource_version = "690755" -> null
          - uid              = "84986718-871e-49cf-b69f-392a1979ca15" -> null
            # (1 unchanged attribute hidden)
        }

      - role_ref {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "ClusterRole" -> null
          - name      = "github-sp-access" -> null
        }

      - subject {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "Group" -> null
          - name      = "328cbe61-aeb1-4782-bb36-d288c69b4f15" -> null
          - namespace = "authentication" -> null
        }
    }

  # module.services.kubernetes_role_binding_v1.sp_access["core"] will be destroyed
  # (because kubernetes_role_binding_v1.sp_access is not in configuration)
  - resource "kubernetes_role_binding_v1" "sp_access" {
      - id = "core/github-sp-access" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "github-sp-access" -> null
          - namespace        = "core" -> null
          - resource_version = "690758" -> null
          - uid              = "e391eed2-ad0b-45c5-af86-fd9871ba69b9" -> null
            # (1 unchanged attribute hidden)
        }

      - role_ref {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "ClusterRole" -> null
          - name      = "github-sp-access" -> null
        }

      - subject {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "Group" -> null
          - name      = "e87d6f10-6fc0-4a09-a9b0-e8c994ed4052" -> null
          - namespace = "core" -> null
        }
    }

  # module.services.kubernetes_role_binding_v1.sp_access["correspondence"] will be destroyed
  # (because kubernetes_role_binding_v1.sp_access is not in configuration)
  - resource "kubernetes_role_binding_v1" "sp_access" {
      - id = "correspondence/github-sp-access" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "github-sp-access" -> null
          - namespace        = "correspondence" -> null
          - resource_version = "690750" -> null
          - uid              = "8ef4122f-1b9c-45e4-9e2e-a983a9c4d3f5" -> null
            # (1 unchanged attribute hidden)
        }

      - role_ref {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "ClusterRole" -> null
          - name      = "github-sp-access" -> null
        }

      - subject {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "Group" -> null
          - name      = "e36ca3b3-f495-45a5-bca4-4fc83424633f" -> null
          - namespace = "correspondence" -> null
        }
    }

  # module.services.kubernetes_role_binding_v1.sp_access["dialogporten"] will be destroyed
  # (because kubernetes_role_binding_v1.sp_access is not in configuration)
  - resource "kubernetes_role_binding_v1" "sp_access" {
      - id = "dialogporten/github-sp-access" -> null

      - metadata {
          - annotations      = {} -> null
          - generation       = 0 -> null
          - labels           = {} -> null
          - name             = "github-sp-access" -> null
          - namespace        = "dialogporten" -> null
          - resource_version = "690754" -> null
          - uid              = "bbf996f1-db28-46a9-9cf4-e813d3847e9c" -> null
            # (1 unchanged attribute hidden)
        }

      - role_ref {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "ClusterRole" -> null
          - name      = "github-sp-access" -> null
        }

      - subject {
          - api_group = "rbac.authorization.k8s.io" -> null
          - kind      = "Group" -> null
          - name      = "b22b612d-9dc5-4f8b-8816-e551749bd19c" -> null
          - namespace = "dialogporten" -> null
        }
    }

Plan: 1 to add, 2 to change, 54 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @monteiro-renato |
| Action | `pull_request` |
| Working Directory | `./infrastructure/adminservices-test/k6tests-rg` |
| State File | `github.com/altinn/altinn-platform/environments/test/k6tests-rg.tfstate` |
| Plan File | `github.com_altinn_altinn-platform_environments_test_k6tests-rg.tfstate.tfplan` |